# IsSavingAsCentralFile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentSavedAsEventArgs..::..IsSavingAsCentralFile Property
DocumentSavedAsEventArgs Class See Also
---
Indicates whether the document is to be saved as central file.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public bool IsSavingAsCentralFile { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsSavingAsCentralFile As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsSavingAsCentralFile {
	bool get ();
}
```

# See Also
DocumentSavedAsEventArgs Class
Autodesk.Revit.DB.Events Namespace